sysbench/output/cacheline128/oltp-update-index.out
sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 1 tps: 197.31 qps: 197.31 (r/w/o: 0.00/197.31/0.00) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 175.01 qps: 175.01 (r/w/o: 0.00/175.01/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1 tps: 192.61 qps: 192.61 (r/w/o: 0.00/192.61/0.00) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 178.20 qps: 178.20 (r/w/o: 0.00/178.20/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1 tps: 188.20 qps: 188.20 (r/w/o: 0.00/188.20/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 185.00 qps: 185.00 (r/w/o: 0.00/185.00/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 1 tps: 187.59 qps: 187.59 (r/w/o: 0.00/187.59/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 169.40 qps: 169.40 (r/w/o: 0.00/169.40/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 1 tps: 186.20 qps: 186.20 (r/w/o: 0.00/186.20/0.00) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 190.60 qps: 190.60 (r/w/o: 0.00/190.60/0.00) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 1 tps: 187.20 qps: 187.20 (r/w/o: 0.00/187.20/0.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 1 tps: 195.81 qps: 195.81 (r/w/o: 0.00/195.81/0.00) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           11167
        other:                           0
        total:                           11167
    transactions:                        11167  (186.10 per sec.)
    queries:                             11167  (186.10 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      186.0985
    time elapsed:                        60.0059s
    total number of events:              11167

Latency (ms):
         min:                                    2.68
         avg:                                    5.37
         max:                                  179.97
         95th percentile:                        8.28
         sum:                                59988.94

Threads fairness:
    events (avg/stddev):           11167.0000/0.00
    execution time (avg/stddev):   59.9889/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 2 tps: 327.23 qps: 327.23 (r/w/o: 0.00/327.23/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 2 tps: 366.63 qps: 366.63 (r/w/o: 0.00/366.63/0.00) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 2 tps: 343.20 qps: 343.20 (r/w/o: 0.00/343.20/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 2 tps: 372.20 qps: 372.20 (r/w/o: 0.00/372.20/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 2 tps: 358.00 qps: 358.00 (r/w/o: 0.00/358.00/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 2 tps: 373.00 qps: 373.00 (r/w/o: 0.00/373.00/0.00) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 2 tps: 356.99 qps: 356.99 (r/w/o: 0.00/356.99/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 2 tps: 352.61 qps: 352.61 (r/w/o: 0.00/352.61/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 2 tps: 349.58 qps: 349.58 (r/w/o: 0.00/349.58/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 2 tps: 365.61 qps: 365.61 (r/w/o: 0.00/365.61/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 2 tps: 358.20 qps: 358.20 (r/w/o: 0.00/358.20/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 2 tps: 354.80 qps: 354.80 (r/w/o: 0.00/354.80/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           21393
        other:                           0
        total:                           21393
    transactions:                        21393  (356.52 per sec.)
    queries:                             21393  (356.52 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      356.5215
    time elapsed:                        60.0048s
    total number of events:              21393

Latency (ms):
         min:                                    2.83
         avg:                                    5.61
         max:                                  508.77
         95th percentile:                        8.90
         sum:                               119973.05

Threads fairness:
    events (avg/stddev):           10696.5000/1.50
    execution time (avg/stddev):   59.9865/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 4 tps: 638.07 qps: 638.07 (r/w/o: 0.00/638.07/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 611.25 qps: 611.25 (r/w/o: 0.00/611.25/0.00) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 607.60 qps: 607.60 (r/w/o: 0.00/607.60/0.00) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 601.97 qps: 601.97 (r/w/o: 0.00/601.97/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 633.03 qps: 633.03 (r/w/o: 0.00/633.03/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 628.18 qps: 628.18 (r/w/o: 0.00/628.18/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 597.82 qps: 597.82 (r/w/o: 0.00/597.82/0.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 634.20 qps: 634.20 (r/w/o: 0.00/634.20/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 592.00 qps: 592.00 (r/w/o: 0.00/592.00/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 611.59 qps: 611.59 (r/w/o: 0.00/611.59/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 616.20 qps: 616.20 (r/w/o: 0.00/616.20/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 597.01 qps: 597.01 (r/w/o: 0.00/597.01/0.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           36847
        other:                           0
        total:                           36847
    transactions:                        36847  (614.09 per sec.)
    queries:                             36847  (614.09 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      614.0864
    time elapsed:                        60.0030s
    total number of events:              36847

Latency (ms):
         min:                                    2.72
         avg:                                    6.51
         max:                                   54.02
         95th percentile:                       10.46
         sum:                               239947.79

Threads fairness:
    events (avg/stddev):           9211.7500/11.56
    execution time (avg/stddev):   59.9869/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 1076.88 qps: 1076.88 (r/w/o: 0.00/1076.88/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 1103.62 qps: 1103.62 (r/w/o: 0.00/1103.62/0.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 1104.20 qps: 1104.20 (r/w/o: 0.00/1104.20/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 1109.98 qps: 1109.98 (r/w/o: 0.00/1109.98/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 1088.61 qps: 1088.61 (r/w/o: 0.00/1088.61/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 1142.00 qps: 1142.00 (r/w/o: 0.00/1142.00/0.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 1070.81 qps: 1070.81 (r/w/o: 0.00/1070.81/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1072.40 qps: 1072.40 (r/w/o: 0.00/1072.40/0.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 1107.20 qps: 1107.20 (r/w/o: 0.00/1107.20/0.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 1044.79 qps: 1044.79 (r/w/o: 0.00/1044.79/0.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 1077.02 qps: 1077.02 (r/w/o: 0.00/1077.02/0.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1090.59 qps: 1090.59 (r/w/o: 0.00/1090.59/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           65451
        other:                           0
        total:                           65451
    transactions:                        65451  (1090.77 per sec.)
    queries:                             65451  (1090.77 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1090.7669
    time elapsed:                        60.0046s
    total number of events:              65451

Latency (ms):
         min:                                    3.08
         avg:                                    7.33
         max:                                  149.23
         95th percentile:                       11.65
         sum:                               479936.44

Threads fairness:
    events (avg/stddev):           8181.3750/26.37
    execution time (avg/stddev):   59.9921/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 16 tps: 2022.72 qps: 2022.72 (r/w/o: 0.00/2022.72/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 16 tps: 1963.23 qps: 1963.23 (r/w/o: 0.00/1963.23/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 16 tps: 1988.58 qps: 1988.58 (r/w/o: 0.00/1988.58/0.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 2020.59 qps: 2020.59 (r/w/o: 0.00/2020.59/0.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 16 tps: 2011.59 qps: 2011.59 (r/w/o: 0.00/2011.59/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 1981.43 qps: 1981.43 (r/w/o: 0.00/1981.43/0.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 16 tps: 1925.36 qps: 1925.36 (r/w/o: 0.00/1925.36/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 1982.40 qps: 1982.40 (r/w/o: 0.00/1982.40/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 16 tps: 1831.02 qps: 1831.02 (r/w/o: 0.00/1831.02/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 1833.41 qps: 1833.41 (r/w/o: 0.00/1833.41/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 16 tps: 1785.98 qps: 1785.98 (r/w/o: 0.00/1785.98/0.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 1891.83 qps: 1891.83 (r/w/o: 0.00/1891.83/0.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           116212
        other:                           0
        total:                           116212
    transactions:                        116212 (1936.65 per sec.)
    queries:                             116212 (1936.65 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1936.6509
    time elapsed:                        60.0067s
    total number of events:              116212

Latency (ms):
         min:                                    3.04
         avg:                                    8.26
         max:                                  188.55
         95th percentile:                       12.75
         sum:                               959904.81

Threads fairness:
    events (avg/stddev):           7263.2500/18.03
    execution time (avg/stddev):   59.9941/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 32 tps: 3390.65 qps: 3390.65 (r/w/o: 0.00/3390.65/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 32 tps: 3472.51 qps: 3472.51 (r/w/o: 0.00/3472.51/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 32 tps: 3295.16 qps: 3295.16 (r/w/o: 0.00/3295.16/0.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 3457.44 qps: 3457.44 (r/w/o: 0.00/3457.44/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 32 tps: 3469.65 qps: 3469.65 (r/w/o: 0.00/3469.65/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 3485.63 qps: 3485.63 (r/w/o: 0.00/3485.63/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 32 tps: 3353.60 qps: 3353.60 (r/w/o: 0.00/3353.60/0.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 3314.87 qps: 3314.87 (r/w/o: 0.00/3314.87/0.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 32 tps: 3568.79 qps: 3568.79 (r/w/o: 0.00/3568.79/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 3279.46 qps: 3279.46 (r/w/o: 0.00/3279.46/0.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 32 tps: 3340.54 qps: 3340.54 (r/w/o: 0.00/3340.54/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 3535.53 qps: 3535.53 (r/w/o: 0.00/3535.53/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           204862
        other:                           0
        total:                           204862
    transactions:                        204862 (3413.81 per sec.)
    queries:                             204862 (3413.81 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      3413.8108
    time elapsed:                        60.0098s
    total number of events:              204862

Latency (ms):
         min:                                    3.37
         avg:                                    9.37
         max:                                  211.61
         95th percentile:                       14.21
         sum:                              1919856.65

Threads fairness:
    events (avg/stddev):           6401.9375/20.17
    execution time (avg/stddev):   59.9955/0.00